GB-Link/GB-Link-Switch-LDN/firmware/ESP32-S3/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_PICO_LINK_TX_GPIO=2
CONFIG_PICO_LINK_RX_GPIO=1
CONFIG_LWIP_DHCPS_STATIC_ENTRIES=y
CONFIG_FREERTOS_HZ=1000
# 1.5 MB for the app; the NVS partition that holds the keys stays where the default table puts it.
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
